# Operations on the entire dataframe

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
os.system("clear")
stem = os.getcwd()

In [3]:
filename = "../ZZ_Data/cars.csv"
colsIwannaUse = ["Name", "Horsepower", "Acceleration"]
df = pd.read_csv(filename, usecols=colsIwannaUse, nrows=7)
df = df.set_index("Name")
print(df)
dfOrg = df.copy()

                           Horsepower  Acceleration
Name
chevrolet chevelle malibu         130          12.0
buick skylark 320                 165          11.5
plymouth satellite                150          11.0
amc rebel sst                     150          12.0
ford torino                       140          10.5
ford galaxie 500                  198          10.0
chevrolet impala                  220           9.0

##  Changing all cell values

In [4]:
### Fill 'not a number' with a number of your choice
df = df.fillna(0)
df

                           Horsepower  Acceleration
Name
chevrolet chevelle malibu         130          12.0
buick skylark 320                 165          11.5
plymouth satellite                150          11.0
amc rebel sst                     150          12.0
ford torino                       140          10.5
ford galaxie 500                  198          10.0
chevrolet impala                  220           9.0

In [5]:
### Change the type of all cell values
df = df.astype(int)
df

                           Horsepower  Acceleration
Name
chevrolet chevelle malibu         130            12
buick skylark 320                 165            11
plymouth satellite                150            11
amc rebel sst                     150            12
ford torino                       140            10
ford galaxie 500                  198            10
chevrolet impala                  220             9

##  Multiplying a dataframe with a number

In [6]:
number = 7.7
df = df * number
df

                           Horsepower  Acceleration
Name
chevrolet chevelle malibu      1001.0          92.4
buick skylark 320              1270.5          84.7
plymouth satellite             1155.0          84.7
amc rebel sst                  1155.0          92.4
ford torino                    1078.0          77.0
ford galaxie 500               1524.6          77.0
chevrolet impala               1694.0          69.3

## Adding or subtracting one dataframe from another dataframe

In [7]:
### Just to show the technique, using other data would be more meaningful here
dfSub = df - dfOrg
print(dfSub)

                           Horsepower  Acceleration
Name
chevrolet chevelle malibu       871.0          80.4
buick skylark 320              1105.5          73.2
plymouth satellite             1005.0          73.7
amc rebel sst                  1005.0          80.4
ford torino                     938.0          66.5
ford galaxie 500               1326.6          67.0
chevrolet impala               1474.0          60.3

## Transpose a dataframe

In [8]:
dfT = df.T
dfT

Name,chevrolet chevelle malibu,buick skylark 320,plymouth satellite,amc rebel sst,ford torino,ford galaxie 500,chevrolet impala
Horsepower,1001.0,1270.5,1155.0,1155.0,1078.0,1524.6,1694.0
Acceleration,92.4,84.7,84.7,92.4,77.0,77.0,69.3

In [9]:
## Inverse a dataframe
### There is built-in functionality to inverse a dataframe in Pandas